import os
import sys


from korean_alphabets import eumjul

chosung_dic ={
"ㄱ":"g",
"ㄴ":"n",
"ㄷ":"d",
"ㄹ":"r",
"ㅁ":"m",
"ㅂ":"b",
"ㅅ":"s",
"ㅇ":"",
"ㅈ":"j",
"ㅊ":"ch",
"ㅋ":"k",
"ㅌ":"t",
"ㅍ":"p",
"ㅎ":"h",
"ㄲ":"k",
"ㄸ":"t",
"ㅃ":"p",
"ㅆ":"s",
"ㅉ":"ch"
        }
moum_dic = {
"ㅏ":"a",
"ㅓ":"eo",
"ㅗ":"o",
"ㅜ":"u",
"ㅡ":"eu",
"ㅣ":"i",
"ㅐ":"ae",
"ㅔ":"e",
"ㅑ":"ya",
"ㅒ":"yae",
"ㅕ":"yeo",
"ㅖ":"ye",
"ㅛ":"yo",
"ㅠ":"yu",
"ㅘ":"wa",
"ㅙ":"wae",
"ㅚ":"oe",
"ㅝ":"wo",
"ㅟ":"wi",
"ㅢ":"ui",
"ㅞ":"we",
""  :""
        }
jongseong_dic = {
"ㄱ":"g",
"ㄴ":"n",
"ㄷ":"d",
"ㄹ":"l",
"ㅁ":"m",
"ㅂ":"b",
"ㅅ":"s",
"ㅇ":"ng",
"ㅈ":"j",
"ㅊ":"ch",
"ㅋ":"k",
"ㅌ":"t",
"ㅍ":"p",
"ㅎ":"h",
"ㄺ":"lg",
"ㄻ":"lm",
"ㄼ":"lb",
"ㄵ":"nj",
"ㅄ":"bs",
"ㅀ":"lh",
"ㄲ":"k",
"ㄸ":"t",
"ㅉ":"ch",
"ㅃ":"p",
"ㅆ":"s",
"ㄳ":"gs",
"ㄶ":"nh",
"ㄾ":"lt",
"ㄿ":"lp",
""  :""
}

kor2rom_list = [chosung_dic, moum_dic, jongseong_dic]
